Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, None,  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, None, None, 3 1472        input_1[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, None, None, 3 0           conv2d[0][0]                     
                                                                 conv2d_1[0][0]                   
                                                                 conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
                                                                 conv2d_4[0][0]                   
                                                                 conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
                                                                 conv2d_8[0][0]                   
                                                                 conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
                                                                 conv2d_11[0][0]                  
                                                                 conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
                                                                 conv2d_14[0][0]                  
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
dropout (Dropout)               (None, None, None, 3 0           leaky_re_lu[0][0]                
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, None, None, 3 9248        dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, None, 3 0           leaky_re_lu[1][0]                
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, None, None, 3 9248        dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, None, None, 3 0           leaky_re_lu[2][0]                
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, None, None, 3 9248        dropout_2[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, None, 3 0           leaky_re_lu[3][0]                
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, None, None, 3 9248        dropout_3[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, None, 3 0           leaky_re_lu[4][0]                
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, None, None, 3 9248        dropout_4[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, None, None, 3 0           leaky_re_lu[5][0]                
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, None, None, 3 9248        dropout_5[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, None, None, 3 0           leaky_re_lu[6][0]                
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, None, None, 3 9248        dropout_6[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, None, None, 3 0           leaky_re_lu[7][0]                
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, None, None, 3 9248        dropout_7[0][0]                  
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, None, None, 3 0           leaky_re_lu[8][0]                
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, None, None, 3 9248        dropout_8[0][0]                  
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, None, None, 3 0           leaky_re_lu[9][0]                
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, None, None, 3 9248        dropout_9[0][0]                  
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, None, None, 3 0           leaky_re_lu[10][0]               
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, None, None, 3 9248        dropout_10[0][0]                 
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, None, None, 3 0           leaky_re_lu[11][0]               
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, None, None, 3 9248        dropout_11[0][0]                 
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, None, None, 3 0           leaky_re_lu[12][0]               
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, None, None, 3 9248        dropout_12[0][0]                 
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, None, None, 3 0           leaky_re_lu[13][0]               
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, None, None, 3 9248        dropout_13[0][0]                 
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, None, None, 3 0           leaky_re_lu[14][0]               
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, None, None, 3 9248        dropout_14[0][0]                 
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, None, None, 3 0           leaky_re_lu[15][0]               
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, None, None, 6 198         dropout_15[0][0]                 
==================================================================================================
Total params: 140,390
Trainable params: 140,390
Non-trainable params: 0
__________________________________________________________________________________________________
None
